{
  "translations" :{
    "en": {
      ".exerciseTitle": "Infix To Postfix",
      ".instructLabel": "Instructions:",
      ".instructions": "Convert the infix expression into a postfix expression in the table below. You can move elements to the Bit Bucket to make them disappear.",
      "av_infix_expression": "Infix Expression",
      "av_stack": "Stack",
      "av_postfix_expression": "Postfix Expression",
      "av_bit_bucket": "Bit Bucket",
      "av_ms_com_operand": "The operands go directly into the postfix expression.",
      "av_ms_com_leftpar": "The left parenthesis is pushed to the stack.",
      "av_ms_com_rightpar": "After we have read a right parenthesis, we pop the operators from the stack and put them into the postfix expression, until we find a left parenthesis.",
      "av_ms_com_mul": "The top of the stack, \"*\", has the same precedence as the read value, \"*\", so we pop it from the stack and put it in the postfix expression.",
      "av_ms_com_mulpush": "The \"*\" operator is pushed into the stack.",
      "av_ms_com_ge_prec": "The top of the stack, \"{operator}\", has a greater or equal precedence compared to the read value(\"+\"), so we pop it from the stack and put it in the postfix expression.",
      "av_ms_com_pluspush": "The \"+\" operator is pushed into the stack.",
      "av_ms_com_rest": "Pop the rest of the operators from the stack and put them in the postfix expression."
    },
    "fi": {
      ".exerciseTitle": "Infix-Postfix muunnos",
      ".instructLabel": "Ohjeet:",
      ".instructions": "Luo ylemmässä taulukossa olevaa infix-lauseketta vastaava postfix-muoto alempaan taulukkoon simuloimalla algoritmia. Arvoja voi siirtää paikasta toiseen klikkaamalla. Halutessaan arvot saa katoamaan siirtämällä ne bittiavaruuteen.",
      "av_infix_expression": "Infix-lauseke",
      "av_stack": "Pino",
      "av_postfix_expression": "Postfix-lauseke",
      "av_bit_bucket": "Bittiavaruus",
      "av_ms_com_operand": "Operandit menevät suoraan postfix-lausekkeeseen.",
      "av_ms_com_leftpar": "Vasen sulkumerkki laitetaan pinoon.",
      "av_ms_com_rightpar": "Oikean sulkumerkin jälkeen, operaattorit viedään pinosta postfix-lausekkeeseen kunnes vastaan tulee vasen sulkumerkki.",
      "av_ms_com_mul": "Pinon päällimmäisellä merkillä, \"*\", on sama presendenssi kuin luetulla arvolla, \"*\", joten se viedään postfix-lausekkeeseen.",
      "av_ms_com_mulpush": "\"*\"-operaattori viedään pinoon.",
      "av_ms_com_ge_prec": "Pinon päällimmäisellä merkillä, \"{operator}\", on suurempi tai yhtä suuri presendenssi kuin luetulla arvolla, \"+\", joten se viedään postfix-lausekkeeseen.",
      "av_ms_com_pluspush": "\"+\"-operaattori viedään pinoon.",
      "av_ms_com_rest": "Viedään jäljellä olevat merkit pinosta postfix-lausekkeeseen."
    }
  },
  "code" : {
    "english": "The infix expression is read one symbol at a time (in this case a character at a time).\nIf the read symbol is an operand, it goes directly into the postfix expression.\nIf the symbol is a left parenthesis it is pushed onto the stack.\nIf it is a right parenthesis, the operators from the stack are popped to the postfix expression until the corresponding left parenthesis is found. Both the left and the right parenthesis will disappear in this process.\nIf the symbol that was read is an operator which has a precedence higher than does the topmost element in the stack, the read symbol is pushed onto the stack.\nIf the read symbol is an operator which has a precedence less or equal to the precedence of the topmost element in the stack, the topmost element is popped to the postfix expression. This is repeated until the read symbol can be pushed onto the stack.\nWhen the input ends, the symbols left in the stack are popped to the postfix expression.",

    "finnish": "Luetaan Infix-lauseketta symboli kerrallaan (tässä merkki kerrallaan).\nLuetut operandit viedään suoraan Postfix-lausekkeeseen.\nLuettu vasen sulkumerkki viedään pinoon.\nLuettu oikea sulkumerkki tyhjentää pinosta operaattoreita Postfix-lausekkeeseen, kunnes löytyy sitä vastaava vasen sulkumerkki. Prosessissa molemmat sulkumerkit katoavat.\nJos luettu merkki oli operaattori, jonka presedenssi on suurempi kuin pinon päällimmäisen alkion presedenssi, viedään se pinoon.\nJos luettu merkki oli operaattori, jonka presendenssi on pienempi tai yhtä suuri kuin pinon päällimmäisen alkion presedenssi, viedään pinon päällimmäisin operaattori Postfix-lausekkeeseen. Tätä toistetaan vertaamalla luettua operaattoria seuraavana pinossa olevaan alkioon. Lopuksi luettu operaattori asetetaan pinon päällimmäiseksi.\nKun syöte loppuu, pinossa vielä olevat alkiot tyhjennetään Postfix-lausekkeeseen."
  }
}