{
  "translations" :{
    "en": {
      ".avTitle": "Mergesort Proficiency Exercise",
      "av_Authors": "Daniel Breakiron",
      ".instructLabel": "Instructions:",
      ".instructions": "Start at the bottom left. Merge two single element arrays to sort a sorted two-element array. Continue merging until you reach an array whose child arrays have not BOTH been sorted. Return to single element arrays and repeat the merging process as necessary until all elements have been merged into a single, sorted array. To merge an element into another array, click the element to select it, then click the position where it should be in the sorted, merged array. Remember, the order in which blocks are merged matters so be sure to select the smallest blocks first, starting at the left.",
      "#help": "Help",
      "#about": "About"
    },
    "fi": {
      ".avTitle": "Lomitusjärjestäminen",
      "av_Authors": "Daniel Breakiron",
      ".instructLabel": "Ohjeet:",
      ".instructions": "Aloita vasemmasta alakulmasta yhdistämällä kaksi yhden alkion kokoista taulukkoa järjesteltyyn kahden alkion kokoiseen taulukkoon. Jatka yhdistelyä kunnes saavut taulukkoon, jonka <strong>molempia</strong> osataulukoita ei vielä ole järjestelty. Tässä tapauksessa palaa yhden alkion kokoisiin taulukkoihin ja toista yhdistämisprosessia kunnes kaikki alkiot on yhdistetty yhteen järjesteltyyn taulukkoon. Voit valita alkion klikkaamalla sitä. Klikkaa tämän jälkeen sijaintia, johon haluat siirtää valitun alkion. Muista, että järjestyksellä on väliä! Liitä aina pienin alkio ensin, aloittaen vasemmalta.",
      "#help": "Ohje",
      "#about": "Lisätietoa"
    },
    "sv": {
      ".avTitle": "Mergesort",
      "av_Authors": "Daniel Breakiron",
      ".instructLabel": "Instruktioner:",
      ".instructions": "Börja längst ned till vänster. Slå samman (merge) två ettelementssekvenser för att skapa en sorterad tvåelementssekvens. Fortsätt sammanslagningen till du stöter på en sekvens vars delsekvenser inte BÅDA har sorterats. Återvänd till ettelementsekvenser och upprepa sammanslagningsproceduren efter behov till alla element har slagits samman till en helt sorterad sekvens. För att infoga ett element i en annan sekvens, klicka på elementet för att välja det och klicka sedan på positionen där det borde vara i den sorterade sammanslagna sekvensen. Kom ihåg att ordningen i vilken blocken slås samman spelar roll, så var noga med välja det minsta blocket först och börja från vänster.",
      "#help": "Hjälp",
      "#about": "Om"
    }
  },
  "params": {
    "JXOP-feedback": "continuous",
    "JXOP-fixmode": "fix"
  }
}
