{
  "translations" : {
    "en": {
      ".avTitle": "Heapsort Proficiency Exercise",
      "av_Authors": "Ville Karavirta",
      ".instructLabel": "Instructions:",
      ".instructions": "Reproduce the behavior of heapsort for the <strong>maximum</strong> heap below. You can swap keys by clicking the first one and then the second one in either of the representations (array or binary tree). Begin by swapping the last key with the largest key, and reducing the size of the heap by one (by clicking the \"Decrement heap size\" button). After that, restore the heap property again.",
      "#help": "Help",
      "#about": "About",
      "#decrement": "Decrement heap size",
      "av_c1": "We start by swapping largest and last items in heap.",
      "av_c2": "Again, we swap largest and last items in heap.",
      "av_c3": "...swap largest and last items in heap.",
      "av_c4": "<br/>...decrement the heap size",
      "av_c5": "<br/>...and restore the heap property",
      "av_c6": ""
    },
    "fi": {
      ".avTitle": "Kekojärjestäminen - Heapsort",
      "av_Authors": "Ville Karavirta",
      ".instructLabel": "Ohjeet:",
      ".instructions": "Järjestä alla oleva <strong>maksimikeko</strong> kekojärjestämisalgoritmilla. Kahden avaimen paikkaa keossa voidaan vaihtaa klikkaamalla niitä peräkkäin (kummassa tahansa esitysmuodossa). Aloita vahtamalla keon viimeinen avain suurimman avaimen kanssa, jonka jälkeen kekoa pienennetään yhdellä (Pienennä kekon kokoa -painikkeella). Tämän jälkeen kekoehto tulee palauttaa voimaan.",
      "#help": "Ohje",
      "#about": "Lisätietoa",
      "#decrement": "Pienennä keon kokoa",
      "av_c1": "Aloitetaan vaihtamalla suurimman ja viimeisen alkion paikkaa keossa.",
      "av_c2": "Vaihdetaan taas suurimman ja viimeisen alkion paikkaa keskenään.",
      "av_c3": "...vaihdetaan suurimman ja viimeisen alkion paikkaa keskenään.",
      "av_c4": "<br/>...pienennetään keon kokoa",
      "av_c5": "<br/>...palautetaan kekoehto",
      "av_c6": ""
    }
  },
  "params": {
    "JXOP-feedback": "continuous",
    "JXOP-fixmode": "fix"
  },
  "code": {
    "pseudo": {
      "url": "../../SourceCode/Pseudo/Sorting/Heapsort.txt",
      "tags": {}
    }
  }
}
