{
  "translations" :{
    "en": {
      ".exerciseTitle": "Quicksort",
      ".instructLabel": "Instructions:",
      ".instructions": "In this exercise you are supposed to sort the array below by simulating the Quicksort algorithm. The pivot is colored orange, and picked and moved to the end of the sublist automatically. Your task in this exercise is to <strong>perform the partitioning, move the pivot into place after the partitioning and to make the function calls</strong>.<br><br>To select a bar, simply click on it. You can then click on another bar to swap it with the selected bar. The recursive Quicksort call can be made by clicking the <strong>call</strong> button and selecting the bounds for the function. Return from the function by clicking the <strong>return</strong> button. The call stack under the array shows the bounds for which the Quicksort function has been called.",
      "table_to_be_sorted": "Array to be sorted",
      "call_stack": "Call Stack",
      "call": "Call",
      "return": "Return",
      "left_endpoint": "Select the <strong>left endpoint</strong>.",
      "right_endpoint": "Select the <strong>right endpoint</strong>.",
      "ms_put_pivot_to_the_right": "The pivot is placed on the right side of the bound.",
      "ms_partition": "The values on the left side of the pivot are partitioned, so that values smaller than the pivot will end on the left side of values that are larger or equal to the pivot.",
      "ms_put_pivot_into_correct_position": "The pivot is swapped with the first value from the left which is greater or equal to the pivot. Now the smaller values are on the left side and the larger values on the right side of the pivot. The pivot is in its final sorted position.",
      "ms_call_left": "The Quicksort function is called for the values on the left side of the pivot. ",
      "ms_call_right": "The Quicksort function is for the values on the right side of the pivot. ",
      "ms_no_pivot": "Sublists of size {size} or less are sorted using another algorithm.",
      "ms_return": "The function is done sorting the values between the indices {left} and {right}."
    },
    "fi": {
      ".exerciseTitle": "Quicksort",
      ".instructLabel": "Ohjeet:",
      ".instructions": "Järjestä alla oleva taulukko simuloimalla Quicksort-algoritmia. Pivot arvo on värjätty oranssiksi, ja se valitaan ja siiretään oikeaan laitaan puolestasi. Tehtäväsi on suorittaa <strong>partitiointi, pivotin siirto partitioinnin jälkeen ja funktiokutsut</strong>.<br><br>Arvoja voi siirtää paikasta toiseen klikkaamalla. Tee funktiokutsu painamalla  <strong>call</strong>-nappia ja valitsemalla tämän jälkeen vasen ja oikea raja. Palaa funktiosta painamalla <strong>return</strong>-nappia. Taulukon alla oleva kutsupino näyttää mille välille Quicksort-funktiota on kutsuttu.",
      "table_to_be_sorted": "Järjestettävä taulukko",
      "call_stack": "Kutsupino",
      "call": "Call",
      "return": "Return",
      "left_endpoint": "Valitse <strong>vasen raja</strong>.",
      "right_endpoint": "Valitse <strong>oikea raja</strong>.",
      "ms_put_pivot_to_the_right": "Pivot-arvo siirretään kutsutun alueen oikeaan laitaan.",
      "ms_partition": "Partition-funktio lajittelee pivotia pienemmät arvot vasemmalle ja pivotia suuremmat tai yhtä suuret arvot oikealle.",
      "ms_put_pivot_into_correct_position": "Pivot-arvo siirretään lopulliselle paikalleen, siten että vasemmalle puolella on vain pienempiä arvoja ja oikealle puolella vain suurempia tai yhtä suuria arvoja.",
      "ms_call_left": "Quicksort-funktiota kutsutaan pivotin vasemalla puolella oleville arvoille. ",
      "ms_call_right": "Quicksort-funktiota kutsutaan pivotin oikealla puolella oleville arvoille. ",
      "ms_no_pivot": "Alueet, joiden koko on {size} tai vähemmän, järjestetään toisella algoritmillä.",
      "ms_return": "Funktio on järjestänyt taulukon indeksien {left} ja {right} välillä."
    }
  },
  "code" : {
    "processing": {
      "url": "../../SourceCode/Processing/Sorting/Quicksort.pde",
      "startAfter": "/* *** ODSATag: partition *** */",
      "endBefore": "/* *** ODSAendTag: Quicksort *** */",
      "tags": {
        "comments_and_findpivot": [9, 11, 12, 13, 14, 15, 16]
      }
    }
  }
}